Autodesk.Revit.DB.BuiltInFailures.CreationFailures.SwitchFromLegendBeforeCreateSimilar
To Create Similar from a Legend View, first select the element, then activate the target view, then invoke Create Similar.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotUpdateWall
Can't update Wall.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeWall
Can't make Wall.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurfaceWarn
Can't construct surface.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurfaceError
Can't construct surface.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurface
Can't construct surface.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFaceError
Can't make roof from vertical face.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFace
Can't make roof from vertical face.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawWallsError
Can't make Wall.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawWalls
Can't make Wall.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoofWall
Can't make roof.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoofError
Can't make roof.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoof
Can't make roof.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawProfileRoof
Can't make footprint roof.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateThis
Can't create [Element].

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSystemPanel
Can't create Curtain Panel in opening. The opening is probably too small.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlabEdgeWarn
Could not create Slab Edge. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlabEdgeError
Could not create Slab Edge. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlabEdge
Could not create Slab Edge. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealWarn
Could not create Reveal. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegralWarn
Could not create integral reveal for wall instance. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegralError
Could not create integral reveal for wall instance. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegral
Could not create integral reveal for wall instance. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealError
Could not create Reveal. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateReveal
Could not create Reveal. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpeningRectangularArcWall
Creation of a Rectangular Arc Wall Opening failed.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpeningCutOut
Can't create Opening cut.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpening
Cannot create opening.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOldCornerMullion
Cannot change the type of a mullion created prior to release 4.0 to a corner mullion type.  Try deleting the existing mullion and placing a new one.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateNewDesignOption
Cannot create a new empty design option

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateMullionReferenceNoGeometry
Can't create Curtain Wall Mullion. The portion of the curtain grid it was placed on no longer exists.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateMullionReference
Can't create Curtain Wall Mullion. The grid segment for the Mullion is probably too small.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateMullionError
Can't create Mullion.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateMullion
Can't create Mullion.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutterWarn
Could not create Gutter. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutterError
Could not create Gutter. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutter
Could not create Gutter. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateFasciaWarn
Could not create Fascia. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateFasciaError
Could not create Fascia. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateFascia
Could not create Fascia. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateExplicitCrease
Cannot create a new split line based on the picked support.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateElementInView
Can't create this kind of element in this view in the current mode.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateElementInFamily
Can't create element in this family.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCutoutWarn
Can't make cut-out.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCutoutError
Can't make cut-out.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCutout
Can't make cut-out.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCurtainGrid
Can't create Curtain Wall Grid Line.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceWarn
Could not create Wall Sweep. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralWarn
Could not create integral wall sweep for wall instance. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralError
Could not create integral wall sweep for wall instance. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegral
Could not create integral wall sweep for wall instance. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceError
Could not create Wall Sweep. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCornice
Could not create Wall Sweep. [Description]

Autodesk.Revit.DB.BuiltInFailures.CreationFailures
Failures about CreationFailures.